Tekla.Structures.Model.ISharingLocation
Represents a location used for sharing in the Tekla Structures model.

Tekla.Structures.Model.ISharingLocation.Id
Gets the unique identifier of the sharing location.

Tekla.Structures.Model.ISharingLocation.Name
Gets the name of the sharing location. It does not change based on the TS language.

Tekla.Structures.Model.ISharingLocation.DisplayName
Gets the display name of the sharing location. It uses the current TS language when feasible.